// ফাংশন নেম দিতে হবে picnicBudget]: প্যারামিটার হিসাবে নিবে কয়জন পিকিনিক এ যাবে সেই সংখ্যা।

//যদি ১০০ বা তার কম যায় তাহলে প্রত্যেক এর জন্য খরচ হবে ৫০০০ টাকা করে।

//যদি ১০০ এর বেশি কিন্তু ২০০ এর কম বা সমান যায় তাহলে প্রথম ১০০ জন এর প্রতি জন এর জন্য ৫০০০ টাকা করে দিতে হবে। আর ১০০ এর বেশি (অর্থাৎ ১০১ নম্বর থেকে) যতজন আছে তাদের প্রত্যেক ওই জন্য ৪০০০ টাকা করে দিতে হবে।

//আর যদি ২০০ এর বেশি যায় তাহলে প্রথম ১০০ জন এর প্রতি জন এর জন্য ৫০০০ টাকা করে দিতে হবে। আর ১০০ এর বেশি যতজন আছে তাদের প্রত্যেক ওই জন্য ৪০০০ টাকা করে দিতে হবে।



//তাহলে প্রথম ১০০এর জন্য খরচ 5000 টাকা করে দিতে হবে। আর ১০০ এর বেশি অর্থাৎ ১০১ নম্বর থেকে থেকে ২০০ পর্যন্ত (অর্থাৎ ২০০ সমান বা কম) পর্যন্ত যতজন আছে তাদের প্রত্যেক এর জন্য ৪০০০ টাকা করে দিতে হবে। এর ২০০ এর বেশি যতজন আছে তাদের প্রত্যেক এর জন্য ৩০০০ টাকা করে দিতে হবে।



//এখন আমি একটা প্যারামিটার দিবো। সেটা যেকোন সংখ্যা হতে পারে। সেই সংখ্যা অনুসারে তুমি ফাংশন থেকে রিটার্ন দিবে কতটাকা পিকনিক এর বাজেট হতে হবে। ইনপুট প্যারামিটার সংখ্যাটা ১০০ এর কম হতে পারে। ১০০ থেকে ২০০ এর মধ্যে হতে পারে। আবার ২০০ এর বেশিও হতে পারে। তাই সব কেইস ভালো করে টেস্ট করে নিবে।
function picnicBudget(jon){
    if(jon<=100){
        return 5000*jon;
    }
    else if(jon>100 && jon<=200){
        var cost1 = 5000*100;
        var baki = jon-100;
        var cost2 = baki*4000;
        totalcost = cost1+cost2;
        return totalcost;
    }
    else if(jon>200){
        var cost1 = 5000*100;
        var cost2=  4000*100;
        var baki = jon-200;
        var cost3 = baki*3000;
        totalcost = cost1+cost2+cost3;
        return totalcost;
    }
}
console.log(picnicBudget(300));